Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/unemployed_people/conditions_for_getting_a_jobseekers_payment.html.txt.tmx
Source language: en
Languages: ga

source: You can be disqualified from Jobseeker’s Benefit if you are aged under 55 and get a redundancy payment of more than €50,000
ga: Is féidir go ndícháileofar thú ó Shochar Cuardaitheora Poist más rud é go bhfuil tú faoi bhun 55 bliain d’aois agus go bhfaigheann tú íocaíocht iomarcaíochta os cionn €50,000

source: The exact length of your disqualification (up to 9 weeks) will depend on the amount of redundancy payment you receive
ga: Beidh fad beacht do dhícháilithe (suas go dtí 9 seachtaine) ag brath ar mhéid na híocaíochta iomarcaíochta a fhaigheann tú

source: You can also be disqualified from a jobseeker’s payment if you do not co-operate with the Department of Social Protection’s identity checking procedures for issuing you with a Public Services Card
ga: Is féidir go ndícháileofar thú ó íocaíocht cuardaitheora poist freisin mura gcomhoibríonn tú le gnáthaimh sheiceála aitheantais na Roinne Coimirce Sóisialaí le haghaidh Cárta Seirbhísí Poiblí a eisiúint duit

source: You can appeal a decision to disqualify you from a payment to the Social Welfare Appeals Office
ga: Is féidir leat achomharc a dhéanamh in aghaidh cinnidh chun tú a dhícháiliú ó íocaíocht chuig an Oifig Achomharc Leasa Shóisialaigh

source: When you apply for a jobseeker’s payment you will be asked to sign a Record of Mutual Commitments (pdf) which explains your rights and responsibilities while you are getting your jobseeker’s payment from the Department of Social Protection
ga: Nuair a dhéanfaidh tú iarratas ar íocaíocht cuardaitheora poist, iarrfar ort Taifead Gealltanas Frithpháirteach (pdf) a shíniú, rud ina mínítear na cearta atá agat agus na dualgais atá ort le linn duit d’íocaíocht cuardaitheora poist a fháil ón Roinn Coimirce Sóisialaí (RCS)

source: Depending on your personal profile, you may be given an appointment for a further meeting with a DSP Case Officer
ga: Ag brath ar do phróifíl phearsanta, is féidir go dtabharfar coinne duit le haghaidh cruinniú eile le cásoifigeach RCS

source: At this meeting your Case Officer will discuss your options with you and agree your Personal Progression Plan to prepare you to find employment
ga: Ag an gcruinniú sin, pléifidh an cásoifigeach na roghanna atá agat agus aontóidh sé do Phlean Dul Chun Cinn Pearsanta leat chun tú a ullmhú do phost a fháil

source: You will get ongoing advice and support to help you meet the goals in your Personal Progression Plan
ga: Gheobhaidh tú comhairle agus tacaíocht leanúnach chun cabhrú leat na spriocanna atá i do Phlean Dul Chun Cinn Pearsanta a chomhlíonadh

source: You can read about the employment services the Department of Social Protection offers to jobseekers
ga: Is féidir leat tuilleadh a léamh faoi na seirbhísí fostaíochta a chuireann an Roinn Coimirce Sóisialaí ar fáil do chuardaitheoirí poist

source: If you do not keep to the steps agreed in the Record of Mutual Commitments and the other conditions of your jobseeker’s payment, your payment can be reduced and eventually stopped altogether
ga: Mura leanann tú na bearta atá aontaithe i dTaifead na nGealltanas Frithpháirteach ná coinníollacha eile d’íocaíochta cuardaitheora poist, is féidir d’íocaíocht a laghdú agus deireadh a chur léi ina hiomláine

source: Specifically you can be paid a penalty rate of JA or JB if you refuse or fail to:
ga: Go sonrach, is féidir go n-íocfar ráta pionóis de Liúntas Cuardaitheora Poist nó de Shochar Cuardaitheora Poist leat más rud é go dteipeann ort:

source: • Attend meetings requested by the DSP or
ga: • Freastal ar chruinnithe a iarrann an RCS nó

source: • Participate in an appropriate employment support scheme, work experience or training
ga: • Páirt a ghlacadh i scéim tacaíocht fostaíochta, i dtaithí oibre nó in oiliúint atá cuí

source: If you have been placed on a penalty rate and you continue not to meet the conditions you can be disqualified from your jobseeker’s payment for up to 9 weeks
ga: Más rud é gur cuireadh ar ráta pionóis thú agus leanann tú ort gan na coinníollacha a chomhlíonadh, féadfar tú a dhícháiliú ó d’íocaíocht cuardaitheora poist ar feadh 9 seachtaine ar a mhéad

source: You cannot be disqualified immediately – a penalty rate must apply first for at least 21 days
ga: Ní féidir tú a dhícháiliú lom láithreach - caithfidh ráta pionóis bheith i bhfeidhm ar feadh 21 lá ar a laghad

source: │Personal rate │Reduction to │
ga: │Ráta pearsanta │Laghdú go │

source: Penalty rates do not apply to people over 62
ga: Níl feidhm ag rátaí pionóis maidir le daoine atá os cionn 62 bliain d’aois

source: If you wish to appeal a decision (including a decision on a penalty rate) you should make this appeal to the Social Welfare Appeals Office using the contact information below
ga: ba cheart duit an t-achomharc sin a dhéanamh chuig an Oifig Achomhairc Leasa Shóisialaigh ach úsáid a bhaint as an bhfaisnéis teagmhála thíos

source: You apply for Jobseeker's Benefit or Jobseeker's Allowance to your Intreo Centre or Social Welfare Branch Office
ga: Déanann tú iarratas ar Shochar Cuardaitheora Poist nó ar Liúntas Cuardaitheora i d’ionad áitiúil Intreo nó i d’oifig áitiúil leasa shóisialaigh
